# -*- coding:utf-8 -*-
# 作   者：Ailian
# 开发时间：2021/6/10 上午10:18

"""
字典是映射类型
"""

brand = ['李宁', '耐克', '阿迪达斯', '鱼C工作室']
slogan = ['一切皆有可能', 'Just do it', 'Impossible is nothing', '让编程改变世界']

# 输出耐克的品牌及口号
print('耐克的口号是：', slogan[brand.index('耐克')])

# 把品牌和其口号存储到字典中做成映射关系
dict1 = {'李宁': '一切皆有可能', '耐克': 'Just do it', '阿迪达斯': 'Impossible is nothing', '鱼C工作室': '让编程改变世界'}
print('鱼C工作室的口号是：', dict1['鱼C工作室'])

print('=================字典的创建方法==================')
# 字典只有一个参数
# ① 通过传入映射关系的数组或者列表创建字典
dict2 = dict((('a', 12), ('b', 22), ('c', 33), ('d', 44)))
print(dict2)
print('-----------------------------------------------')
dict3 = dict((['a', 12], ['b', 22], ['c', 33], ['d', 44]))
print(dict3)

# ② 通过传入键值对的方式创建字典
dict4 = dict(小甲鱼='让编程改变世界', 动漫='让二次元缓解宅男宅女')
print(dict4)

# ③ 直接通过字典的键进行赋值，从而创建字典
dict4['小甲鱼'] = '沙雕'
print(dict4)
dict4['成功'] = '灵感'
print(dict4)
