# -*- coding:utf-8 -*-
# 作    者：Ailian
# 开发时间：2022/9/14 14:16

i = 0  # 统计系统循环执行的次数
while i < 3:  # 0,1,2,当 i=3 时，3<3 False，循环执行结束
    user_name = input("请输入您的用户名:")
    pwd = input("请输入您的密码:")
    # 判断
    if user_name == "zxj" and pwd == "888888":
        print("系统正在登录，请稍后")
        # 改变循环条件，退出循环
        i = 8  # 判断8<3，False，循环执行结束
    else:
        if i < 2:  # 加了这个判断，就不会出现 "您还有0次机会" 的提示语
            print("用户名或密码不正确，您还有", 2 - i, "次机会")
        i += 1  # 改变循环变量

if i == 3:#当用户输入账号或密码不正确，循环执行结束时，i的最大值为 3
    print("您输入三次账号或密码错误，账号被锁定30分钟！")